from django.core.management import BaseCommand

from maistorbox.accounts.models import Regions, Specializations


class Command(BaseCommand):
    help = 'Populate the database with regions and specializations'

    def handle(self, *args, **kwargs):
        regions_list = [
            'София', 'София-област',
            'Пловдив', 'Пловдив-област',
            'Варна', 'Варна-област',
            'Бургас', 'Бургас-област',
            'Русе', 'Русе-област',
            'Стара Загора',
            'Плевен',
            'Сливен',
            'Добрич',
            'Шумен',
            'Перник',
            'Хасково',
            'Ямбол',
            'Благоевград',
            'Велико Търново',
            'Враца',
            'Габрово',
            'Кърджали',
            'Кюстендил',
            'Ловеч',
            'Монтана',
            'Пазарджик',
            'Разград',
            'Силистра',
            'Смолян',
            'Tърговище',
            'Видин',
            'Сандански',
            'Димитровград', ]

        specializations_list = [
            'Изкопни работи',
            'Основи и фундаменти',
            'Груб строеж',
            'Зидария',
            'Покривни конструкции',
            'Хидроизолация',
            'Топлоизолация',
            'Фасадни работи',
            'Вътрешни ремонти',
            'Сухо строителство',
            'Шпакловане и мазилки',
            'Поставяне на подови настилки',
            'Лепене на плочки',
            'Поставяне на облицовки и фаянс',
            'Електроинсталации',
            'ВиК инсталации',
            'ОВК (Отопление, Вентилация, Климатизация)',
            'Сглобяеми конструкции',
            'Пътно строителство',
            'Градинско и парково строителство',
            'Реставрация и консервация на сгради',
            'Довършителни работи',
            'Мебелировка и интериорен дизайн',
            'Метални конструкции',
            'Дървени конструкции',
            'Монтаж на дограма и стъклопакети',
            'Озеленяване',
            'Доставка на строителни материали',
            'Почистване на строителни обекти',
            'Монтаж на гипсокартон',
            'Обезопасителни системи (парапети, огради)',
            'Поставяне на шумоизолация',
            'Полагане на асфалт',
            'Настилка от бетон',
            'Монтаж на слънчеви панели',
            'Монтаж на асансьори и подемни съоръжения',
            'Монтаж на окачени тавани',
            'Облицовка с камък и декоративни панели',
            'Бояджииски услуги',
            'Монтаж на отоплителни котли и камини',
            'Полагане на декоративни мазилки',
            'Изработка и монтаж на перголи и навеси',
            'Видеонаблюдение и сигнално-охранителни системи',
            'Интелигентни сградни системи (smart home)']

        for region_name in regions_list:
            Regions.objects.get_or_create(name=region_name)

        for specialization_name in specializations_list:
            Specializations.objects.get_or_create(name=specialization_name)

        self.stdout.write(self.style.SUCCESS('Regions and Specializations populated successfully'))
